
from server.models import *


def m1():
    data = '''
catagories	Barcode	Quantity	Comment	Product name	Price	Quantity per box
อ หมา	8 8591 04004 92 4			DNJ ลูกและแม่สุนัข 500g	50	
อ หมา	8 8591 04004 91 7			DNJ พันธุ์เล็ก รสเนื้อวัวและตับไก่ 500g	50	
อ หมา	8 8591 04004 90 0			DNJ โต รสเนื้อวัวและตับไก่ 500g	50	
อ หมา	8 8591 04005 00 6			DNJ ลูกและแม่สุนัข 1.5kg	135	
อ หมา	8 8591 04004 98 6			DNJ พันธุ์เล็ก รสเนื้อวัวและตับไก่ 1.5kg	135	
อ หมา	8 8591 04004 99 3			DNJ พันธุ์เล็ก รสไก่และตับไก่ 1.5kg	135	
อ หมา	8 8591 04004 93 1			DNJ โต รสเนื้อวัวและตับไก่ 1.5kg	125	
อ หมา	8 8591 04004 94 8			DNJ โต รสไก่และตับไก่ 1.5kg	125	
อ หมา	8 8591 04004 95 5			DNJ โต รสแกะ 1.5kg	125	
อ หมา	8 8591 04004 96 2			DNJ โต รสแซลมอน 1.5kg	135	
อ หมา	8 8591 04004 97 9			DNJ โต สูตรเจ 1.5kg	135	
อ หมา	8 8591 04005 08 2			DNJ ลูกและแม่สุนัข 3kg	240	
อ หมา	8 8591 04005 06 8			DNJ พันธุ์เล็ก รสเนื้อวัวและตับไก่ 3kg	240	
อ หมา	8 8591 04005 07 5			DNJ พันธุ์เล็ก รสไก่และตับไก่ 3kg	240	
อ หมา	8 8591 04005 01 3			DNJ โต รสเนื้อวัวและตับไก่ 3kg	220	
อ หมา	8 8591 04005 02 0			DNJ โต รสไก่และตับไก่ 3kg	220	
อ หมา	8 8591 04005 03 7			DNJ โต รสแกะ 3kg	220	
อ หมา	8 8591 04005 04 4			DNJ โต รสแซลมอน 3kg	240	
อ หมา	8 8591 04005 05 1			DNJ โต สูตรเจ 3kg	240	
อ หมา	8 8591 04005 09 9			DNJ ลูกและแม่สุนัข 8kg	530	
อ หมา	8 8591 04005 15 0			DNJ พันธุ์เล็ก รสเนื้อวัวและตับไก่ 10kg	580	
อ หมา	8 8591 04005 16 7			DNJ พันธุ์เล็ก รสไก่และตับไก่ 10kg	580	
อ หมา	8 8591 04005 10 5			DNJ โต รสเนื้อวัวและตับไก่ 10kg	530	
อ หมา	8 8591 04005 11 2			DNJ โต รสไก่และตับไก่ 10kg	530	
อ หมา	8 8591 04005 12 9			DNJ โต รสแกะ 10kg	530	
อ หมา	8 8591 04005 13 6			DNJ โต รสแซลมอน 10kg	580	
อ หมา	8 8591 04005 14 3			DNJ โต สูตรเจ 10kg	580	
อ หมา	8 8591 04005 17 4			DNJ โต รสเนื้อวัวและตับไก่ 20kg	920	
อ หมา	8 8591 04005 18 1			DNJ โต รสไก่และตับไก่ 20kg	920	
อ หมา	8 8591 04005 19 8			DNJ โต รสแกะ 20kg	920	
อ หมา	8 8591 04005 20 4			DNJ โต รสแซลมอน 20kg	950	
อ หมา	8 8533 01131 98 8			PED ลูก รสตับ ผักและนม 400g	51	
อ หมา	6 9149 73309 80 7			PED ลูก รสไก่ ไข่และนม 400g	51	
อ หมา	8 8533 01132 97 8			PED MINI พันธุ์เล็ก รสไก่ ตับและผัก 400g	45	
อ หมา	9 3342 14033 22 8			PED MINI พันธุ์เล็ก รสตับย่าง 400g	45	
อ หมา	8 8533 01300 06 3			PED โต รสไก่และผัก 500g	50	
อ หมา	8 8533 01133 00 5			PED MINI พันธุ์เล็ก รสเนื้อวัว แกะและผัก 400g	45	
อ หมา	6 9149 73309 70 8			PED โต รสเนื้อวัวและผัก 500g	50	
อ หมา	8 8533 01130 14 1			PED โต รสตับและผัก 500g	50	
อ หมา	9 3342 14022 92 5			PED โต รสเนื้อวัวและผัก 1.5kg	145	
อ หมา	9 3342 14022 95 6			PED โต รสไก่และผัก 1.5kg	145	
อ หมา	9 3342 14022 98 7			PED โต รสตับและผัก 1.5kg	145	
อ หมา	9 3342 14023 56 4			PED MINI ลูกสุนัขพันธุ์เล็ก รสนม 1.3kg	149	
อ หมา	8 8533 01131 99 5			PED ลูก รสตับ ผักและนม 1.3kg	149	
อ หมา	9 3100 22530 70 8			PED ลูก รสไก่ ไข่และนม 1.3kg	149	
อ หมา	8 8533 01893 71 8			PED MINI พันธุ์เล็ก รสเนื้อวัว แกะและผัก 1.3kg	135	
อ หมา	8 8533 01893 59 6			PED MINI พันธุ์เล็ก รสไก่ ตับและผัก 1.3kg	135	
อ หมา	9 3342 14033 25 9			PED MINI พันธุ์เล็ก รสตับย่าง 1.3kg	135	
อ หมา	8 8533 01132 00 8			PED ลูก รสตับ ผักและนม 2.7kg	235	
อ หมา	8 8533 01130 97 4			PED ลูก รสไก่ ไข่และนม 2.7kg	235	
อ หมา	9 3342 14033 27 3			PED MINI พันธุ์เล็ก รสตับย่าง 2.7kg	230	
อ หมา	8 8533 01893 67 1			PED MINI พันธุ์เล็ก รสไก่ ตับและผัก 2.7kg	230	
อ หมา	8 8533 01893 72 5			PED MINI พันธุ์เล็ก รสเนื้อวัว แกะและผัก 2.7kg	230	
อ หมา	9 3342 14022 96 3			PED โต รสไก่และผัก 3kg	235	
อ หมา	9 3342 14022 93 2			PED โต รสเนื้อวัวและผัก 3kg	235	
อ หมา	9 3342 14022 99 4			PED โต รสตับและผัก 3kg	235	
อ หมา	8 8533 01300 09 4			PED โต รสไก่และผัก 10kg	590	
อ หมา	8 8533 01130 15 8			PED โต รสตับและผัก 10kg	590	
อ หมา	8 8533 01893 75 6			PED MINI พันธุ์เล็ก รสไก่ ตับและผัก 8kg	580	
อ หมา	8 8533 01893 76 3			PED MINI พันธุ์เล็ก รสเนื้อวัว แกะและผัก 8kg	580	
อ หมา	9 3100 22530 50 0			PED โต รสเนื้อวัวและผัก 20kg	"1,010"	
อ หมา	8 8504 77000 94 0	1		SH ลูกสุนัขพันธุ์เล็ก 450g	55	
อ หมา	8 8504 77811 50 8	1		SH ลูกสุนัข รสเนื้อวัวและนม 500g	55	
อ หมา	8 8504 77831 50 6	1		SH ลูกสุนัข รสไก่ ไข่และนม 500g	55	
อ หมา	8 8504 77812 50 5	1		SH พันธุ์เล็ก รสเนื้ออบ 500g	55	
อ หมา	8 8504 77892 45 3	1		SH พันธุ์เล็ก รสสเต๊กเนื้อ 450g	55	
อ หมา	8 8504 77803 50 3	1		SH โต รสไก่และตับ 500g	47	
อ หมา	8 8504 77810 50 1	1		SH โต รสเนื้ออบ 500g	47	
อ หมา	8 8504 77890 45 9	1		SH โต รสสเต๊กเนื้อ 450g	47	
อ หมา	8 8504 77811 02 7	1		SH ลูกสุนัข รสเนื้อวัวและนม 1.5kg	135	
อ หมา	8 8504 77831 02 5	1		SH ลูกสุนัข รสไก่ ไข่และนม 1.5kg	135	
อ หมา	8 8504 77000 95 7	1		SH ลูกสุนัขพันธุ์เล็ก 1.3kg	140	
อ หมา	8 8504 77017 76 4	1		SH แม่และลูกสุนัข 1.3kg	145	
อ หมา	8 8504 77812 02 4	1		SH พันธุ์เล็ก รสเนื้ออบ 1.5kg	140	
อ หมา	8 8504 77832 02 2	1		SH พันธุ์เล็ก รสไก่และตับ 1.5kg	140	
อ หมา	8 8504 77892 13 2	1		SH พันธุ์เล็ก รสสเต๊กเนื้อ 1.3kg	140	
อ หมา	8 8504 77820 05 0	1		SH โต รสตับรมควัน 1.5kg	130	
อ หมา	8 8504 77810 05 1	1		SH โต รสเนื้ออบ 1.5kg	130	
อ หมา	8 8504 77890 13 8	1		SH โต รสสเต๊กเนื้อ 1.3kg	130	
อ หมา	8 8504 77803 05 3	1		SH โต รสไก่และตับ 1.5kg	130	
อ หมา	8 8504 77892 26 2	1		SH พันธุ์เล็ก รสสเต๊กเนื้อ 2.6 kg	240	
อ หมา	8 8504 77812 35 2	1		SH พันธุ์เล็ก รสเนื้ออบ 3kg	240	
อ หมา	8 8504 77832 35 0	1		SH พันธุ์เล็ก รสไก่และตับ 3kg	240	
อ หมา	8 8504 77820 03 6	1		SH โต รสตับรมควัน 3kg	220	
อ หมา	8 8504 77803 03 9	1		SH โต รสไก่และตับ 3kg	220	
อ หมา	8 8504 77810 03 7	1		SH โต รสเนื้ออบ 3kg	220	
อ หมา	8 8504 77890 26 8	1		SH โต รสสเต๊กเนื้อ 2.6kg	220	
อ หมา	8 8504 77000 96 4	1		SH ลูกสุนัขพันธุ์เล็ก 2.6kg	250	
อ หมา	8 8504 77831 35 3	1		SH ลูก รสไก่ ไข่และนม 3kg	240	
อ หมา	8 8504 77811 35 5	1		SH ลูก รสเนื้อวัวและนม 3kg	240	
อ หมา	8 8504 77831 10 0	1		SH ลูก รสไก่ ไข่และนม 8kg	560	
อ หมา	8 8504 77811 08 9	1		SH ลูก รสเนื้อวัวและนม 8kg	560	
อ หมา	8 8504 77820 10 4	1		SH โต รสตับรมควัน 10kg	560	
อ หมา	8 8504 77803 10 7	1		SH โต รสไก่และตับ 10kg	560	
อ หมา	8 8504 77890 09 1	1		SH โต รสสเต๊กเนื้อ 9kg	560	
อ หมา	8 8504 77810 10 5	1		SH โต รสเนื้ออบ 10kg	560	
อ หมา	8 8504 77832 10 7	1		SH พันธุ์เล็ก รสเนื้ออบ 10kg	650	
อ หมา	8 8504 77812 11 6	1		SH พันธุ์เล็ก รสไก่และตับ 10kg	650	
อ หมา	8 8504 77890 18 3	1		SH โต รสสเต๊กเนื้อ 18kg	970	
อ หมา	8 8504 77803 20 6	1		SH โต รสไก่และตับ 20kg	970	
อ หมา	8 8504 77820 20 3	1		SH โต รสตับรมควัน 20kg	970	
อ หมา	8 8504 77812 20 8	1		SH พันธุ์เล็ก รสเนื้ออบ 20kg	"1,170"	
อ หมา	8 8504 77862 50 0	1		SHF fit&firm พันธุ์เล็ก 500g	70	
อ หมา	8 8504 77860 50 6	1		SHG fit&firm โต 500g	65	
อ หมา	8 8504 77862 05 0	1		SHG fit&firm พันธุ์เล็ก 1.5kg	165	
อ หมา	8 8504 77860 05 6	1		SHG fit&firm โต 1.5kg	155	
อ หมา	8 8504 77860 03 2	1		SHG fit&firm โต 3kg	265	
อ หมา	8 8504 77862 03 6	1		SHG fit&firm พันธุ์เล็ก 3kg	285	
อ หมา	8 8504 77872 03 5	1		SHG 7+ พันธุ์เล็ก 3kg	285	
อ หมา	8 8504 77870 03 1	1		SHG 7+ โต 3kg	250	
อ หมา	8 8504 77002 17 3			SHG 7+ โต 10kg	680	
อ หมา	8 8504 77822 03 0	1		SHG holistic พันธุ์เล็ก 3kg	340	
อ หมา	8 8504 77802 03 2	1		SHG holistic โต 3kg	295	
อ หมา	8 8504 77862 10 4	1		SHG fit&firm พันธุ์เล็ก 10kg	770	
อ หมา	8 8504 77860 10 0	1		SHG fit&firm โต 10kg	640	
อ หมา	8 8504 77822 75 7	1		SHG holistic พันธุ์เล็ก 7.5kg	700	
อ หมา	8 8504 77802 75 9	1		SHG holistic โต 7.5kg	600	
อ หมา	8 8504 77002 62 3	1		SHP โต 1kg	130	
อ หมา	8 8504 77002 66 1	1		SHP ลูกสุนัข 1kg	135	
อ หมา	8 8504 77002 63 0	1		SHP โต 3kg	300	
อ หมา	8 8504 77002 67 8	1		SHP ลูกสุนัข 3kg	320	
อ หมา	8 8504 77002 64 7	1		SHP โต 10kg	690	
อ หมา	8 8504 77002 68 5	1		SHP ลูกสุนัข 10kg	750	
อ หมา	8 8504 77013 15 5	1		SHG lamb&rice พันธุ์เล็ก 1kg	179	
อ หมา	8 8504 77013 44 5	1		SHG salmon meal&rice พันธุ์เล็ก 1kg	220	
อ หมา	8 8504 77015 19 7	1		SHG salmon meal&rice ลูกสุนัข 1kg	179	
อ หมา	8 8504 77013 20 9	1		SHG lamb&rice โต 1kg	195	
อ หมา	8 8504 77013 49 0	1		SHG salmon meal&rice โต 1kg	220	
อ หมา	8 8591 04004 70 2			Perfecta ไก่และข้าวกล้องโต 1kg	190	
อ หมา	8 8591 04004 73 3			Perfecta เนื้อและข้าวกล้อง โต 1kg	190	
อ หมา	8 8591 04004 69 6			Perfecta ไก่และข้าวกล้อง พันธุ์เล็ก 1kg	190	
อ หมา	8 8591 04004 72 6			Perfecta เนื้อและข้าวกล้อง  พันธุ์เล็ก 1kg	199	
อ หมา	8 8591 04004 68 9			Perfecta ไก่และข้าวกล้อง ลูกสุนัข 1kg	229	
อ หมา	8 8504 77015 67 8		Promotion เหลือ 50บาท	เลิฟแคร์ พันธุ์เล็ก triple omega 500g	75	
อ หมา	8 8504 77016 98 9			เลิฟแคร์ ลูกสุนัข triple omega 500g	70	
อ หมา	8 8504 77016 71 2			เลิฟแคร์ พันธุ์เล็ก รสตับ นม ผักและไข่ 500g	75	
อ หมา	8 8504 77016 72 9			เลิฟแคร์ พันธุ์เล็ก รสเนื้อ นม ผักและไข่ 500g	75	
อ หมา	8 8504 77016 99 6			เลิฟแคร์ ลูกสุนัข triple omega 2kg	240	
อ หมา	8 8504 77016 69 9			เลิฟแคร์ พันธุ์เล็ก รสตับ นม ผักและไข่ 2kg	260	
อ หมา	8 8504 77016 01 9			เลิฟแคร์ พันธุ์กลาง รสเนื้อ 9kg	650	
อ หมา	8 8504 77016 03 3			เลิฟแคร์ พันธุ์กลาง รสเนื้อ 18kg	1250	
อ หมา	8 8517 59450 80 4		jerhigh	อ.นิ่ม JH MALTESE รสเนื้อ 500g	210	
อ หมา	8 8517 59450 38 5			อ.นิ่ม JH POMERINIAN รสไก่ 500g	210	
อ หมา	8 8517 59455 90 8			อ.นิ่ม JH F.BULLDOG รสแซลมอน 500g	210	
อ หมา	8 8517 59455 88 5			อ.นิ่ม JH BEAGLE รสไก่ 500g	210	
อ หมา	9 3240 52581 12 8	1		อ.สุนัข Buzz ลูกสุนัข sensitive skin รสแกะ เม็ดใหญ่ 1.2kg	199	
อ หมา	8 8571 04030 03 5	1		อ.สุนัข MAXIMA รสแกะและข้าว 2kg	195	
อ หมา	8 8591 04005 75 4	1		Hajiko รสไก่และผัก 1.5kg	130	
อ หมา	8 8591 04005 69 3	1		Hajiko รสแกะและผัก 1.5kg	130	
อ หมา	8 8501 25076 84 6	1		Purina supercoat พันธุ์เล็ก (with chicken) 400g	50	
อ หมา	8 8591 04005 86 0	1		Bingo star Hi-PRO รสเนื้อแกะ 1kg	60	
อ หมา	8 8590 79205 13 5	1		DAILY PET พันธุ์เล็ก รสเนื้อ ไก่และตับ 1kg	45	
อ หมา	8 8501 24040 97 8	1		Alpo โต รสเนื้อวัว ตับและผัก 10kg	480	
อ หมา	8 8584 39001 64 6	1		F1 ลูกสุนัข(ม่วง) 15kg	920	
อ หมา	8 8584 39001 65 3	1		F1 โต (แดง) 15kg	880	
อ หมา	8 8584 39001 63 9	1		F1 โต (เหลือง) 15kg	650	
อ หมา	8 8568 01003 11 3	1		ริชชี่ ลูกสุนัข 10kg	400	
อ หมา	8 8593 06610 35 0	1		ด็อกเกอร์ รสเนื้อ 20kg	510	
อ หมา	8 8593 06610 38 1	1		ด็อกเกอร์ รสตับ 20kg	510	
อ หมา	8 8591 04001 83 1	1		Bingo star รส 3มิกซ์ 20kg	600	
อ หมา	8 8591 04001 14 5	1		Bingo star รสดั้งเดิม 20kg	580	
อ หมา	8 8501 24040 99 2	1		Alpo โต รสเนื้อวัว ตับและผัก 20kg	850	
อ หมา	8 8504 77812 20 8	1		SH พันธุ์เล็ก รสเนื้ออบ 20kg	1170	
อ หมา	8 8591 04004 12 2	1		อ.สุนัข ROTTO 20kg	530	
อ หมา	8 8591 04004 66 5	1		อ.สุนัข ROTTO 10kg	290	
อ หมา	8 8551 34010 02 7	1		ปันๆ รสเนื้อ 10kg	290	
อ หมา	8 8551 34010 91 1	1		ปันๆ รสเนื้อ 1kg	45	
อ หมา	3 1825 50722 53 7	1	royal canin	RC chihuahua ลูกสุนัข 500g	250	
อ หมา	3 1825 50793 56 8	1		RC X-small ลูกสุนัข 500g	180	
อ หมา	3 1825 50793 70 4	1		RC X-small โต 500g	189	
อ หมา	3 1825 50879 90 3	1		RC mini indoor โต 500g	169	
อ หมา	3 1825 50838 34 4	1		RC mini indoor ลูกสุนัข 500g	189	
อ หมา	3 1825 50728 10 2	1		RC chihuahua โต 1.5kg	620	
อ หมา	3 1825 50722 54 4	1		RC chihuahua ลูกสุนัข 1.5kg	620	
อ หมา	3 1825 50727 38 9	1		RC mini indoor โต 1.5kg	479	
อ หมา	3 1825 50793 12 4	1		RC mini adult 800g	180	
อ หมา	3 1825 50838 35 1	1		RC mini indoor ลูกสุนัข1.5kg	499	
อ หมา	3 1825 50402 43 9	1		RC medium ลูกสุนัข 1kg	310	
อ หมา	3 1825 50792 92 9	1		RC mini puppy 800g	219	
อ หมา	3 1825 50402 17 0	1		RC mini adult 2kg	369	
อ หมา	3 1825 50793 00 1	1		RC mini puppy 2kg	590	
อ หมา	3 1825 50708 18 0	1		RC medium ลูกสุนัข 4kg	910	
อ หมา	3 1825 50402 14 9	1		RC maxi ลูกสุนัข 4kg	859	
อ หมา	3 1825 50838 36 8	1		RC mini indoor ลูกสุนัข3kg	899	
อ กป	8 8504 77000 99 5	1	3 กป 110	Me-O กป รสปลาทู 400g	40	
อ กป	8 8504 77515 40 6	1		Me-O กป รสซีฟู๊ดในเยลลี่ 400g	40	
อ กป	8 8504 77516 40 3	1		Me-O กป รสปลาซาร์ดีน 400g	40	
อ กป	8 8504 77517 40 0	1		Me-O กป รสปลาทูน่า 400g	40	
อ กป	9 3100 22807 11 4	1		WK กป รสปลาซาร์ดีน 400g	44	
อ กป	9 3100 22807 61 9	1		WK กป รสปลาทะเล 400g	44	
อ กป	8 8520 21706 40 7	1	3 กป 100	Bellotta กป รสปลาทูในเยลลี่ 400g	40	
อ กป	8 8520 21706 24 7	1		Bellotta กป รสปลาทูน่าในน้ำเกรวี่ 400g	40	
อ กป	8 8520 21706 25 4	1		Bellotta กป รสปลาทูน่าและไก่รวม 3 ชั้น 400g	40	
อ กป	8 8556 48006 49 3	1	3 กป 90	Ostechแมว กป รสทูน่าหน้าไก่ 400g	35	
อ กป	8 8556 48006 51 6	1		Ostechแมว กป รสทูน่าหน้าซีฟู๊ด 400g	35	
อ กป	8 8556 48006 50 9	1		Ostechแมว กป รสทูน่าหน้ากุ้ง 400g	35	
อ กป	8 8556 48006 54 7	1		Ostechแมว กป รสทูน่าหน้าปูอัด 400g	35	
อ กป	8 8556 48006 55 4	1		Ostechแมว กป รสทูน่า  400g	35	
อ กป	8 8556 48006 53 0	1		Ostechแมว กป รสทูน่าหน้าปลาข้าวสาร 400g	35	
อ กป	8 8591 60401 25 5	1	3 กป 90	เหมียวๆ กป รสปลาทูน่าหน้ากุ้งในเยลลี่ 400g	35	
อ กป	8 8591 60400 57 9	1		เหมียวๆ กป รสปลาซาร์ดีนในเยลลี่ 400g	35	
อ กป	8 8591 60401 26 2	1		เหมียวๆ กป รสปลาทูน่าหน้าข้าวสารในเยลลี่ 400g	35	
อ กป	8 8591 60401 24 8	1		เหมียวๆ กป รสปลาทูน่าหน้าเนื้อไก่ในเยลลี่ 400g	35	
อ กป	8 8592 13900 44 5	1		Jumbo กป รสไก่ 400g	39	
อ กป	8 8504 77023 53 6	1	4 กป 110	I.Q. สุนัข กป รสเนื้อ 400g	35	
อ กป	8 8504 77026 18 6	1		I.Q. สุนัข กป รสไก่และข้าว 400g	35	
อ กป	8 8504 77023 52 9	1		I.Q. สุนัข กป รสไก่ 400g	35	
อ กป	8 8504 77026 17 9	1		I.Q. สุนัข กป รสเนื้อและข้าว 400g	35	
อ กป	8 8591 60400 56 2	1	3กป 90	โฮ่งๆ กป รสแกะ 400g	35	
อ กป	8 8591 60402 01 6	1		โฮ่งๆ กป รสตับแบบชิ้นในน้ำเกรวี่  400g	35	
อ กป	8 8591 60400 54 8	1		โฮ่งๆ กป รสไก่ 400g	35	
อ กป	8 8591 60400 55 5	1		โฮ่งๆ กป รสเนื้อวัวแบบชิ้นในน่ำเกรวี่ 400g	35	
อ กป	8 8591 60400 53 1	1		โฮ่งๆ กป รสเนื้อวัวและตับ 400g	35	
อ กป	8 8556 48006 80 6	1	3 กป 100	MC kelly กป รสไก่และตับ 400g	40	
อ กป	8 8556 48006 81 3	1		MC kelly กป รสแกะ 400g	40	
อ กป	8 8556 48006 84 4	1		MC kelly กป รสเนื้อและตับ 400g	40	
อ กป	8 8556 48006 86 8	1		MC kelly กป รสเนื้อข้าวและผัก 400g	40	
อ กป	8 8556 48006 78 3	1		MC kelly กป รสเนื้อ 400g	40	
อ กป	8 8556 48006 79 0	1		MC kelly กป รสไก่ 400g	40	
อ กป	8 8520 21705 94 3	1	3 กป 110	Marvo กป รสเนื้อไก่และตับ 400g	50	
อ กป	8 8520 21705 38 7	1		Marvo กป รสเนื้อไก่ผสมข้าว 400g	50	
อ กป	8 8520 21706 03 2	1		Marvo กป รสเนื้อแกะในน้ำเกรวี่ 400g	50	
อ กป	8 8520 21705 41 7	1		Marvo กป รสเนื้อวัวผสมผัก 400g	50	
อ กป	9 3100 22724 70 1	1		PED กป ลูกสุนัข 700g	83	
อ กป	9 3100 22736 50 6	1		PED รสไก่และตับในน้ำซอส 700g	83	
อ กป	9 3100 22735 90 5	1		PED กป รสเนื้อในน้ำซอส 400g	50	
อ กป	9 3100 22735 80 6	1		PED กป ลูกสุนัข 400g	50	
อ กป	8 8504 77023 47 5	1		SH กป ลูกสุนัข รสเนื้อไก่ ไข่และแครอท 400g	45	
อ กป	8 8504 77814 40 0	1	3กป 110	SH กป รสเนื้อวัวและตับ 400g	40	
อ กป	8 8504 77015 92 0	1		SH กป รสเนื้อวัวและผัก 400g	40	
อ กป	8 8504 77834 40 8	1		SH กป รสไก่และตับ 400g	40	
อ กป	8 8504 77015 94 4	1		SH กป รสไก่พร้อมผัก 400g	40	
อ กป	8 8504 77015 90 6	1		SH กป รสเนื้อแกะ 400g	40	
อ กป	9 0035 79311 46 2	1		RC กป starter mother&baby dog 195g	45	
อ กป	9 0035 79311 47 9	1		RC กป สุนัข Junior 195g	45	
อ กป	9 0035 79311 66 0	1		RC กป mother&baby cat 195g	55	
อ กป	8 8520 21705 24 0	1		Bellotta กป รสปลาทูน่าและไก่รวม 3 ชั้น 85g	16	
อ กป	8 8520 21705 26 4	1		Bellotta กป รสปลาทูน่าในน้ำเกรวี่ 85g	16	
เพาวซ์	9 0035 79008 21 8	1	3 ซอง100	RC เพาวซ์ mini puppy 85g	35	
เพาวซ์	9 0035 79008 25 6	1		RC เพาวซ์ mini adult 85g	35	
เพาวซ์	9 0035 79001 51 6	1		RC เพาวซ์ adult chihuahua 85g	35	
เพาวซ์	8 8517 59961 13 3	1		JH เพาวซ์ รสเนื้อไก่ย่างในน้ำเกรวี่ 120g	20	
เพาวซ์	8 8517 59961 10 2	1		JH เพาวซ์ รสเนื้อไก่และตับในน้ำเกรวี่ 120g	20	
เพาวซ์	8 8517 59450 93 4	1		JH เพาวซ์ รสเนื้อวัวย่างและแครอทในน้ำเกรวี่ 120g	20	
เพาวซ์	0 0000 93362 98 6	1		Cesarสุนัข ถาด รสเนื้อและตับ 100g	40	
เพาวซ์	0 0000 93370 86 8	1		Cesarสุนัข ถาด รสแกะ 100g	40	
เพาวซ์	9 3342 14036 49 6	1		Cesarสุนัข ถาด รสตับบด 100g	40	
เพาวซ์	0 0000 93362 99 3	1		Cesarสุนัข ถาด รสไก่ 100g	40	
เพาวซ์	8 8533 01530 05 7	1	โหลละ 255	PED เพาวซ์ ลูกสุนัข รสไก่ในน้ำเกรวี่ 130g	23	
เพาวซ์	8 8533 01530 08 8	1		PED เพาวซ์ รสเนื้อวัวในน้ำเกรวี่ 130g	23	
เพาวซ์	8 8533 01530 03 3	1		PED เพาวซ์ รสเนื้อวัวและไก่ในน้ำเกรวี่ 130g	23	
เพาวซ์	8 8533 01530 02 6	1		PED เพาวซ์ รสไก่ในน้ำเกรวี่ 130g	23	
เพาวซ์	8 8533 01530 04 0	1		PED เพาวซ์ รสไก่และตับในน้ำเกรวี่ 130g	23	
เพาวซ์	8 8533 01530 29 3	1		PED เพาวซ์ รสเนื้อวัวตุ๋นพร้อมผัก 130g	23	
เพาวซ์	8 8533 01530 30 9	1		PED เพาวซ์ รสตับย่างพร้อมผัก 130g	23	
เพาวซ์	8 8591 60402 36 8	1	โหลละ 180	โฮ่งๆ เพาวซ์ รสเนื้อวัวในน้ำเกรวี่ 130g	17	
เพาวซ์	8 8591 60402 38 2	1		โฮ่งๆ เพาวซ์ รสเนื้อไก่และตับในน้ำเกรวี่ 130g	17	
เพาวซ์	8 8591 60402 39 9	1		โฮ่งๆ เพาวซ์ รสเนื้อไก่พร้อมผักในน้ำเกรวี่ 130g	17	
เพาวซ์	8 8591 60402 40 5	1		โฮ่งๆ เพาวซ์ รสเนื้อวัวและตับในเยลลี่ 130g	17	
เพาวซ์	8 8591 60402 41 2	1		โฮ่งๆ เพาวซ์ รสเนื้อไก่และตับในเยลลี่ 130g	17	
เพาวซ์	8 8591 60402 37 5	1		โฮ่งๆ เพาวซ์ รสเนื้อแกะในน้ำเกรวี่ 130g	17	
เพาวซ์	8 8591 60402 35 1	1		โฮ่งๆ เพาวซ์ ลูกสุนัข รสเนื้อไก่และตับในเยลลี่ 130g	17	
เพาวซ์	8 8503 56003 91 8	1	6 ซอง 100	DNJ เพาวซ์ รสเนื้อวัว 120g	20	
เพาวซ์	8 8503 56004 91 5	1		DNJ เพาวซ์ รสเนื้อวัวและตับวัว 120g	20	
เพาวซ์	8 8503 56001 91 4	1		DNJ เพาวซ์ รสไก่ในเยลลี่ 120g	20	
เพาวซ์	8 8503 56002 91 1	1		DNJ เพาวซ์ รสไก่และตับในเยลลี่ 120g	20	
เพาวซ์	8 8503 56007 91 6	1		DNJ เพาวซ์ รสเนื้อแกะ 120g	20	
เพาวซ์	8 8503 56008 91 3	1		DNJ เพาวซ์ รสไก่งวง 120g	20	
เพาวซ์	8 8503 56011 91 3	1	6ซอง 100	SH เพาวซ์ ลูกสุนัข รสไก่และแฮมในน้ำซอส 130g	22	
เพาวซ์	8 8504 77837 45 4	1		SH เพาวซ์ รสเนื้อไก่และตับในเยลลี่ 130g	22	
เพาวซ์	8 8504 77816 45 9	1		SH เพาวซ์ รสเนื้อวัวแบบชิ้นในน้ำเกรวี่ 130g	22	
เพาวซ์	8 8504 77833 45 6	1		SH เพาวซ์ รสเนื้อไก่แบบชิ้นในน้ำเกรวี่ 130g	22	
เพาวซ์	8 8504 77002 98 2	1		SH เพาวซ์ รสเนื้อไก่อบรมควันพร้อมผัก 130g	22	
เพาวซ์	8 8504 77014 91 6	1		SH เพาวซ์ รสปลาแซลมอน 130g	22	
เพาวซ์	8 8504 77018 10 5	1		SH เพาวซ์ เนื้อไก่ชิ้นในน้ำเกรวี่ รสเบคอนและไข่ 120g	22	
เพาวซ์	8 8504 77018 14 3	1		SH เพาวซ์ เนื้อวัวชิ้นในน้ำเกรวี่ รสบูลโกกิ 120g	22	
เพาวซ์	9 0035 79308 92 9	1	3 ซอง 100	RC เพาวซ์แมว Intense Beauty (gravy-salsa-sas) 85g	35	
เพาวซ์	9 0035 79309 51 3	1		RC เพาวซ์แมว Instinctive (jelly-gelatina-gele) 85g	35	
เพาวซ์	9 0035 79311 71 4	1		RC เพาว์แมว Kitten (jelly-gelatina-gele) 85g	35	
เพาวซ์	9 0035 79308 94 3	1		RC เพาว์แมว Kitten (gravy-salsa-sas) 85g	35	
เพาวซ์	8 8556 48009 45 6	1	6 ซอง 95	Ostech เพาวซ์ รสปลาทูน่าหน้าไข่และผักในเยลลี่ 70g	18	
เพาวซ์	8 8556 48009 44 9	1		Ostech เพาวซ์ รสปลาทูน่าหน้าปลาแซลมอนในเยลลี่ 70g	18	
เพาวซ์	8 8556 48009 46 3	1		Ostech เพาวซ์ รสปลาทูน่าหน้ากุ้งในเยลลี่ 70g	18	
เพาวซ์	8 8556 48009 48 7	1		Ostech เพาวซ์ รสปลาทูน่าหน้าซีฟู๊ดในเยลลี่ 70g	18	
เพาวซ์	8 8556 48009 42 5	1		Ostech เพาวซ์ รสปลาทูน่าหน้าชีสในเยลลี่ 70g	18	
เพาวซ์	8 8556 48009 49 4	1		Ostech เพาวซ์ รสปลาทูน่าหน้าหอยเชลล์ในเยลลี่ 70g	18	
เพาวซ์	8 8596 01044 58 4	1		Pramy เพาวซ์ Tuna with Shrimp and Scallop 70g	22	
เพาวซ์	8 8596 01044 57 7	1		Pramy เพาวซ์ Tuna in Jelly 70g	22	
เพาวซ์	8 8596 01044 59 1	1		Pramy เพาวซ์ Chicken and Tuna 70g	22	
เพาวซ์	8 8520 21705 73 8	1	โหลละ 165	Bellotta เพาวซ์ รสปลาทูน่าและปลาแซลมอน 85g	15	
เพาวซ์	8 8520 21705 71 4	1		Bellotta เพาวซ์ รสปลาทูน่า 85g	15	
เพาวซ์	8 8520 21705 62 2	1		Bellotta เพาวซ์ รสปลาทูน่าและไก่ 85g	15	
เพาวซ์	8 8520 21705 69 1	1		Bellotta เพาวซ์ รสปลาทู 85g	15	
เพาวซ์	8 8520 21012 07 2	1		Bellotta เพาวซ์ รสทูน่าหน้าปลาแอนโชวี่ในเยลลี่ 85g	15	
เพาวซ์	8 8520 21012 04 1	1		Bellotta เพาวซ์ รสทูน่าหน้าปลาซาบะในเยลลี่ 85g	15	
เพาวซ์	8 8520 21012 06 5	1		Bellotta เพาวซ์ รสทูน่าหน้าปลาข้าวสารในเยลลี่ 85g	15	
เพาวซ์	8 8520 21012 05 8	1		Bellotta เพาวซ์ รสทูน่าหน้ากุ้งในเยลลี่ 85g	15	
เพาวซ์	8 8533 01550 12 3	1	โหลละ 180	WK เพาวซ์ ลูกแมว รสปลาทู 80g	16	
เพาวซ์	8 8533 01550 04 8	1		WK เพาวซ์ ลูกแมว รสปลาทูน่า 80g	16	
เพาวซ์	8 8533 01550 03 1	1		WK เพาวซ์ รสปลาทู 80g	16	
เพาวซ์	8 8533 01550 01 7	1		WK เพาวซ์ รสปลาทูน่า 80g	16	
เพาวซ์	8 8533 01550 05 5	1		WK เพาวซ์ รสปลาทะเล 80g	16	
เพาวซ์	8 8533 01550 07 9	1		WK เพาวซ์ รสปลาทูและปลาแซลมอน 80g	16	
เพาวซ์	8 8533 01550 02 4	1		WK เพาวซ์ รสปลาทูน่าและปลาเนื้อขาว 80g	16	
เพาวซ์	9 3342 14023 57 1	1		WK เพาวซ์ รสปลาทูน่าพร้อมเนื้อไก่ 80g	16	
เพาวซ์	8 8533 01550 08 6	1		WK เพาวซ์ รสปลาซาบะย่าง 80g	16	
เพาวซ์	8 8533 01000 36 9	1		WK เพาวซ์ แมวสูงวัย7+ รสปลาทู 80g	16	
เพาวซ์	8 8504 77585 80 5	1	6 ซอง 80	Me-O เพาวซ์ ลูกแมว รสปลาทูน่าพร้อมปลาซาร์ดีนในเยลลี่ 80g	16	
เพาวซ์	8 8504 77592 81 0	1		Me-O เพาวซ์ ลูกแมว รสปลาทูน่าในเยลลี่ 80g	16	
เพาวซ์	8 8504 77561 80 9	1		Me-O รสปลาทะเล 80g	16	
เพาวซ์	8 8504 77581 80 7	1		Me-O รสปลาซาร์ดีนและปลากระพงในเยลลี่ 80g	16	
เพาวซ์	8 8504 77582 80 4	1		Me-O รสปลาซาร์ดีนผสมไก่และข้าว 80g	16	
เพาวซ์	8 8504 77583 80 1	1		Me-O รสปลาทูน่าพร้อมไก่ในเยลลี่ 80g	16	
เพาวซ์	8 8504 77584 80 8	1		Me-O รสปลาทูในเยลลี่ 80g	16	
เพาวซ์	8 8504 77586 80 2	1		Me-O รสปลาทูน่าพร้อมปลาเนื้อขาว 80g	16	
เพาวซ์	8 8504 77592 80 3	1		Me-O รสปลาทูน่าในเยลลี่ 80g	16	
เพาวซ์	8 8591 60400 43 2	1	โหลละ 190	Nekko เพาวซ์ ลูกแมว รสไก่มูส 70g	18	
เพาวซ์	8 8591 60400 44 9	1		Nekko เพาวซ์ ลูกแมว รสทูน่ามูส 70g	18	
เพาวซ์	8 8591 60400 97 5	1		Nekko เพาวซ์ ลูกแมว รสทูน่ามูสผสมนมแพะ 70g	18	
เพาวซ์	8 8591 60400 98 2	1		Nekko เพาวซ์ ลูกแมว รสทูน่ามูสผสมแซลมอน 70g	18	
เพาวซ์	8 8591 60400 78 4	1		Nekko เพาวซ์ รสปลาทูน่าในน้ำเกรวี่ 70g	18	
เพาวซ์	8 8591 60400 81 4	1		Nekko เพาวซ์ รสปลาทูน่าหน้าแซลมอนในน้ำเกรวี่ 70g	18	
เพาวซ์	8 8591 60400 80 7	1		Nekko เพาวซ์ รสปลาทูน่าหน้าไก่ในน้ำเกรวี่ 70g	18	
เพาวซ์	8 8591 60400 82 1	1		Nekko เพาวซ์ รสปลาทูน่าหน้าปลาทรายแดงในน้ำเกรวี่ 70g	18	
เพาวซ์	8 8591 60400 79 1	1		Nekko เพาวซ์ รสปลาทูน่าหน้ากุ้งและหอยเชลล์ในน้ำเกรวี่ 70g	18	
เพาวซ์	8 8591 60400 09 8	1		Nekko เพาวซ์ รสปลาทูน่า 70g	18	
เพาวซ์	8 8591 60400 10 4	1		Nekko เพาวซ์ รสปลาทูน่า หน้าเนื้อไก่ 70g	18	
เพาวซ์	8 8591 60400 11 1	1		Nekko เพาวซ์ รสปลาทูน่าหน้าปูอัด 70g	18	
เพาวซ์	8 8591 60400 12 8	1		Nekko เพาวซ์ รสปลาทูน่าหน้าปลาโออบแห้ง 70g	18	
เพาวซ์	8 8591 60400 31 9	1		Nekko เพาวซ์ รสปลาทูน่าหน้าชีส 70g	18	
เพาวซ์	8 8591 60400 34 0	1		Nekko เพาวซ์ รสปลาทูน่าหน้ากุ้งและหอยเชลล์ 70g	18	
เพาวซ์	8 8591 60400 33 3	1		Nekko เพาวซ์ รสปลาทูน่าหน้าปลาข้าวสาร 70g	18	
เพาวซ์	8 8591 60400 32 6	1		Nekko เพาวซ์ รสปลาทูน่าหน้าสาหร่ายและไข่ตุ๋น 70g	18	
เพาวซ์	8 8504 77027 76 3	1	6ซอง95	Me-O delite เพาวซ์ kitten 70g	18	
เพาวซ์	8 8504 77018 01 3	1		Me-O delite เพาวซ์ รสปลาทูน่าในเยลลี่ 70g	18	
เพาวซ์	8 8504 77018 05 1	1		Me-O delite รสปลาทูน่าและปลาโอในเยลลี่ 70g	18	
เพาวซ์	8 8504 77018 03 7	1		Me-O delite เพาวซ์ รสปลาทูน่าและไก่ฉีกในเยลลี่ 70g	18	
เพาวซ์	8 8504 77018 07 5	1		Nekko เพาวซ์ รสปลาทูน่าและปูอัดในเยลลี่ 70g	18	
เพาวซ์	8 8504 77026 29 2	1		Me-O delite เพาวซ์ รสปลาทูน่าผสมกุ้งในน้ำเกรวี่ 70g	18	
เพาวซ์	8 8504 77026 32 2	1		Me-O delite เพาวซ์ รสปลาทูน่าผสมแซลมอนในน้ำเกรวี่ 70g	18	
เพาวซ์	8 8504 77026 30 8	1		Me-O delite เพาวซ์ รสปลาทูน่าผสมชีสในน้ำเกรวี่ 70g	18	
เพาวซ์	4 9022 01211 15 4	1	6ซอง 95	Felix เพาวซ์ ลูกแมว รสไก่ในเยลลี่ 70g	18	
เพาวซ์	4 9022 01206 80 8	1		Felix เพาวซ์ ลูกแมว รสทูน่าในเยลลี่ 70g	18	
เพาวซ์	4 9022 01206 86 0	1		Felix เพาวซ์ รสทูน่าในเยลลี่ 70g	18	
เพาวซ์	4 9022 01206 88 4	1		Felix เพาวซ์ รสแซลมอนในเยลลี่ 70g	18	
เพาวซ์	4 9022 01207 96 6	1		Felix เพาวซ์ รสปลาแมคเคอเรลในเยลลี่ 70g	18	
เพาวซ์	4 9022 01207 31 7	1		Felix เพาวซ์ รสซาร์ดีนในเยลลี่ 70g	18	
เพาวซ์	4 9022 01206 90 7	1		Felix เพาวซ์ รสไก่ในเยลลี่ 70g	18	
เพาวซ์	4 9022 01209 15 1	1		Felix เพาวซ์ รสปลาแซลมอนและมะเขือเทศในเยลลี่ 70g	18	
เพาวซ์	4 9022 01209 12 0	1		Felix เพาวซ์ รสไก่และผักโขมในเยลลี่ 70g	18	
เพาวซ์	4 9022 01209 13 7	1		Felix เพาวซ์ รสทูน่าและผักโขมในเยลลี่ 70g	18	
อ แมว	8 8501 27004 90 8	1		One ลูกแมว 400g	115	
อ แมว	8 8501 27004 92 2	1		One indoor 400g	115	
อ แมว	8 8501 25001 65 7	1		One แซลมอน 380g	115	
อ แมว	8 8501 27004 82 3	1		One ลูกแมว 1.3kg	300	
อ แมว	8 8501 21004 84 3	1		One indoor 1.3kg	300	
อ แมว	8 8501 25001 67 1	1		One แซลมอน 1.2kg	300	
อ แมว	8 8501 25085 01 5	1		One ลูกแมว 3kg	640	
อ แมว	8 8501 25078 22 2	1		One indoor 3kg	640	
อ แมว	8 8501 25001 69 5	1		One แซลมอน 2.7kg	640	
อ แมว	8 8591 04000 02 5	1		CNJ แมวโต รสปลาทู 400g	49	
อ แมว	8 8591 04006 48 5	1		CNJ แมวสูงวัย7+ รสปลาทู 400g	49	
อ แมว	8 8568 01002 25 3	1		CNJ แมวโต รสปลาทู 1.2kg	115	
อ แมว	7 8591 43000 48 3	1		CNJ แมวโต รสปลาทะเล 1.2kg	115	
อ แมว	8 8591 04000 29 2	1		CNJ แมวโต รสแซลมอน 1.2kg	115	
อ แมว	8 8504 77051 50 8	1		Me-O persian โต 400g	55	
อ แมว	8 8504 77055 50 6	1		Me-O ลูกแมว รสปลาทะเล 400g	55	
อ แมว	8 8504 77018 66 2	1		Me-O แม่และลูกแมว 400g	60	
อ แมว	8 8504 77059 50 4	1		Me-O แมวโต รสปลาทูน่า 450g	50	
อ แมว	8 8504 77054 50 9	1		Me-O แมวโต รสปลาทู 450g	50	
อ แมว	8 8504 77056 50 3	1		Me-O แมวโต รสซีฟู๊ด 450g	50	
อ แมว	8 8504 77051 15 7	1		Me-O persian โต 1.1kg	125	
อ แมว	8 8504 77055 15 5	1		Me-O ลูกแมว รสปลาทะเล 1.1kg	120	
อ แมว	8 8504 77018 67 9	1		Me-O แม่และลูกแมว 1.1kg	135	
อ แมว	8 8504 77059 15 3	1		Me-O แมวโต รสปลาทูน่า 1.2kg	120	
อ แมว	8 8504 77054 15 8	1		Me-O แมวโต รสปลาทู 1.2kg	120	
อ แมว	8 8504 77056 15 2	1		Me-O แมวโต รสซีฟู๊ด 1.2kg	120	
อ แมว	8 8504 77051 03 4	1		Me-O persian โต 2.8kg	260	
อ แมว	8 8504 77002 36 4	1		Me-O ลูกแมว รสปลาทะเล 2.8kg	235	
อ แมว	8 8504 77590 03 8	1		Me-O แมวโต รสปลาทูน่า 3kg	235	
อ แมว	8 8504 77540 03 3	1		Me-O แมวโต รสซีฟู๊ด 3kg	235	
อ แมว	8 8504 77554 03 0	1		Me-O แมวโต รสปลาทู 3kg	235	
อ แมว	8 8504 77012 69 1	1		Me-O persian โต 6.8kg	550	
อ แมว	8 8504 77056 07 7	1		Me-O แมวโต รสซีฟู๊ด 7kg	480	
อ แมว	8 8504 77054 07 3	1		Me-O แมวโต รสปลาทู 7kg	480	
อ แมว	8 8551 34014 25 4	1		Oliver แมว รสแกะและข้าว 1kg	70	
อ แมว	8 8571 04030 07 3	1		Maxima แมวโต 2kg	195	
อ แมว	8 8533 01140 79 9	1		WK ลูกแมว รสปลาทะเล 450g	60	
อ แมว	8 8533 01001 91 5	1		WK ลูกแมว รสปลาทู 450g	60	
อ แมว	8 8533 01140 81 2	1		WK ลูกแมว รสปลาทะเล 1.1kg	120	
อ แมว	8 8533 01001 93 9	1		WK ลูกแมว รสปลาทู 1.1kg	120	
อ แมว	8 8533 01000 03 1	1		WK แมวสูงวัย7+ รสปลาทู 1.1kg	120	
อ แมว	9 3100 22866 40 1	1		WK แมวโต รสปลาทะเล 480g	56	
อ แมว	9 3100 22866 10 4	1		WK แมวโต รสปลาทะเล 1.2kg	120	
อ แมว	8 8533 01400 10 7	1		WK แมวโต รสปลาทะเล 3kg	275	
อ แมว	8 8533 01144 89 6	1		WK แมวโต รสปลาซาบะย่าง 480g	56	
อ แมว	8 8533 01144 90 2	1		WK แมวโต รสปลาซาบะย่าง 1.2kg	120	
อ แมว	8 8533 01145 17 6	1		WK แมวโต รสปลาซาบะย่าง 3kg	275	
อ แมว	9 3100 22866 50 0	1		WK แมวโต รสปลาทูน่า 480g	56	
อ แมว	9 3100 22866 20 3	1		WK แมวโต รสปลาทูน่า 1.2kg	120	
อ แมว	8 8533 01400 08 4	1		WK แมวโต รสปลาทูน่า 3kg	275	
อ แมว	8 8533 01140 64 5	1		WK แมวโต รสปลาทู 480g	56	
อ แมว	8 8533 01140 65 2	1		WK แมวโต รสปลาทู 1.2kg	120	
อ แมว	8 8533 01141 01 7	1		WK แมวโต รสปลาทู 3kg	275	
อ แมว	9 3342 14038 49 0	1		WK แมวโต รสปลาทู 7kg	575	
อ แมว	8 8533 01140 09 6	1		WK แมวโต รสปลาทูน่า 7kg	575	
อ แมว	8 8533 01400 14 5	1		WK แมวโต รสปลาทะเล 7kg	575	
อ แมว	8 8501 25072 85 5	1		FK ลูกแมว 400g	55	
อ แมว	8 8501 25071 36 0	1		FK ลูกแมว 1.1kg	120	
อ แมว	8 8501 25072 83 1	1		FK แมวโต รสรวมมิตรปลาทะเล 450g	55	
อ แมว	8 8501 25072 93 0	1		FK แมวโต รสรวมมิตรปลาทะเล 1.2kg	120	
อ แมว	8 8501 25072 95 4	1		FK แมวโต รสรวมมิตรปลาทะเล 3kg	265	
อ แมว	8 8501 25072 91 6	1		FK แมวโต รสซีฟู๊ด 450g	55	
อ แมว	8 8501 25072 89 3	1		FK แมวโต รสซีฟู๊ด 1.2g	120	
อ แมว	8 8501 25073 06 7	1		FK แมวโต รสซีฟู๊ด 3kg	265	
อ แมว	8 8501 25073 16 6	1		FK แมวโต รสซีฟู๊ด 7kg	550	
อ แมว	8 8501 25073 03 6	1		FK แมวโต รสรวมมิตรปลาทะเล 7kg	550	
อ แมว	8 8501 25072 97 8	1		FK แมวโต รสปิังย่าง 450g	55	
อ แมว	8 8501 25072 99 2	1		FK แมวโต รสปิังย่าง 1.2kg	120	
อ แมว	8 8501 25073 14 2	1		FK แมวโต รสปิังย่าง 3kg	265	
อ แมว	8 8501 25073 01 2	1		FK แมวโต indoor 1.2kg	120	
อ แมว	8 8501 25072 87 9	1		FK แมวโต indoor 3kg	265	
อ แมว	8 8551 34011 09 3	1		Snowpy  แมว 7kg	300	
อ แมว	8 8528 41420 06 4	1		โกบี้แคท รสซีฟู๊ด 7kg	380	
อ แมว	8 8591 04001 17 6	1		บิงโกแมว รสออริจินัล 10kg	400	
อ แมว	8 8591 04001 40 4	1		บิงโกแมว รสปลาทู 10kg	420	
อ แมว	0 0178 00104 77 7	1		One ลูกแมว 7.26kg	1350	
อ แมว	8 8501 25001 71 8	1		One แซลมอน 6.6kg	1350	
อ แมว	0 7457 60629 19 0	1	ปกติ 109	Kaniva รสแซลมอน 380g	89	
อ แมว	0 7457 60629 01 5	1	ปกติ 259	Kaniva รสแซลมอน 1.4kg	240	
อ แมว	0 7457 60629 51 0	1	ปกติ 520	Kaniva รสแซลมอน 3kg	460	
อ แมว	0 7457 60629 33 6	1	ปกติ 109	Kaniva รสไก่ 380g	89	
อ แมว	0 7457 60629 50 3	1	ปกติ 520	Kaniva รสไก่ 3.2kg	460	
อ แมว	0 8058 49045 83 6	1	ปกติ 1490	Kaniva รสไก่ 10kg	1350	
อ แมว	0 7457 60629 02 2	1	ปกติ 1490	Kaniva รสแซมอล 9kg	1350	
อ แมว	8 8504 77002 53 1	1	ปกติ 135	Me-O gold fit&firm 400g	79	
อ แมว	8 8504 77002 54 8	1	ปกติ 320	Me-O gold fit&firm 1.2kg	159	
อ แมว	8 8504 77002 59 3	1	ปกติ 135	Me-O gold persian 400g	79	
อ แมว	8 8504 77002 60 9	1	ปกติ 320	Me-O gold persian 1.2kg	179	
อ แมว	8 8504 77002 50 0	1	ปกติ 135	Me-O gold indoor 400g	79	
อ แมว	8 8504 77014 99 2	1	ปกติ 335	Me-O gold kitten 400g	189	
อ แมว	3 1825 50702 15 7	1		RC แมว FIT32 400g	99	
อ แมว	3 1825 50702 20 1	1		RC แมว FIT32 2kg	349	
อ แมว	3 1825 50721 72 1	1		RC แมว hair&skin 400g	180	
อ แมว	3 1825 50721 73 8	1		RC แมว hair&skin 2kg	710	
อ แมว	3 1825 50704 61 8	1		RC แมว indoor 400g	139	
อ แมว	3 1825 50704 62 5	1		RC แมว indoor 2kg	599	
อ แมว	3 1825 50707 30 5	1		RC แมว mother&baby cat 400g	170	
อ แมว	3 1825 50707 31 2	1		RC แมว mother&baby cat 2kg	640	
อ แมว	3 1825 50702 42 3	1		RC แมว kitten 2kg	609	
อ แมว	3 1825 50702 60 7	1		RC แมวโต persian 400g	180	
อ แมว	3 1825 50702 61 4	1		RC แมวโต persian 2kg	710	
อ แมว	3 1825 50721 20 2	1		RC ลูกแมว persian 400g	180	
อ แมว	8 8528 41420 13 2	1		โกบี้แคท รสปลาทะเล 500g	35	
อ แมว	8 8528 41420 03 3	1		โกบี้แคท รสซีฟู๊ด-ทูน่า 500g	35	
อ แมว	8 8528 41420 02 6	1		โกบี้แคท รสซีฟู๊ด-ทูน่า 1kg	65	
อ แมว	8 8504 77023 35 2	1		Apro I.Q. ลูกแมว 1kg	65	
อ แมว	8 8504 77013 55 1	1		Apro I.Q. แมวโต 3มิกซ์ 1kg	65	
อ แมว	8 8591 04003 23 1	1		Bingo star แมว รสปลาทู 1kg	60	
อ แมว	8 8591 04007 00 0	1		Bingo star แมว Hi-pro รสเนื้อแกะ 1kg	65	
อ แมว	8 8504 77015 05 0	1		Zoicat mix flavor 1kg	55	
อ แมว	8 8590 79205 14 2	1		อ.แมว Dailypet	55	
สัตว์ฟันแทะ	8 8698 70100 45 4			หนอนนกอบแห้ง ไข่มุกฟาร์ม 	30	
สัตว์ฟันแทะ	4 8970 14970 75 9			หนอนอบแห้ง Xtra Bite 60g	95	
สัตว์ฟันแทะ	8 8502 38025 34 2			อ.หนู Buddy 0.5ปอนด์	35	
สัตว์ฟันแทะ	8 8502 38025 32 8			อ.หนู Buddy 1.25ปอนด์	70	
สัตว์ฟันแทะ	8 8587 74502 00 6			อ.หนู Mr.mice 300g	40	
สัตว์ฟันแทะ	4 8970 14970 20 9			อ.หนู jolly 400g	80	
สัตว์ฟันแทะ	8 8504 77022 29 4			อ.หนู SH Zelect Muesli 500g	75	
สัตว์ฟันแทะ	8 8504 77022 39 3			อ.ลูกกระต่าย Zelect Muesli 500g	65	
สัตว์ฟันแทะ	8 8504 77022 38 6			อ.ลูกกระต่าย Zelect Muesli 1.5kg	175	
สัตว์ฟันแทะ	8 8504 77022 37 9			อ.กระต่ายโต Zelect Muesli 500g	75	
สัตว์ฟันแทะ	8 8504 77710 01 6			อ.กระต่าย BUNNY 1kg	95	
สัตว์ฟันแทะ	8 8504 77022 31 7			อ.กระต่าย Zelect adult 500g	105	
สัตว์ฟันแทะ	8 8504 77022 35 5			อ.กระต่าย Zelect sensitive 500g	90	
สัตว์ฟันแทะ	8 8504 77852 01 3			อ.สัตว์ฟันแทะ SH 1kg	80	
สัตว์ฟันแทะ	8 8504 77000 90 2			อ.ลูกกระต่าย(ส้ม) SH 1kg	120	
สัตว์ฟันแทะ	8 8504 77870 01 7			อ.กระต่าย กลิ่นแอปเปิล(เขียว) SH 1kg	110	
สัตว์ฟันแทะ	8 8504 77849 01 3			อ.กระต่าย ผักและธัญพืช(ฟ้า) SH 1kg	110	
สัตว์ฟันแทะ	8 8569 29000 24 7			อ.กระต่าย TOP 1kg	28	
สัตว์ฟันแทะ	4 8970 14979 61 5			ทรายหนู Jolly กลิ่นมิ้น(เขียว) 500g	40	
สัตว์ฟันแทะ	4 8970 14977 64 2			ทรายหนู Jolly กลิ่นลาเวนเดอร์(ม่วง) 500g	40	
สัตว์ฟันแทะ	4 8970 14977 66 6			ทรายหนู Jolly กลิ่นกุหลาบ(ชมพู) 500g	40	
สัตว์ฟันแทะ	8 8502 38025 61 8			ทรายหนู BUDDY กระปุก350g	51	
สัตว์ฟันแทะ	8 8502 38025 51 9	1		ทรายหนู BUDDY 1kg	50	
สัตว์ฟันแทะ	8 8502 38025 53 3	1		ทรายหนู BUDDY 3kg	120	
สัตว์ฟันแทะ	0 8383 95000 53 0			"Oat, Wheat &Barley 0.4536kg"	195	
สัตว์ฟันแทะ	8 8528 41629 42 9			GP055 ก้านปอ Max Pet Bedding	90	
สัตว์ฟันแทะ	8 8512 91002 02 8			เบ็ทเทอร์ คอบ 4L	195	
สัตว์ฟันแทะ	8 7112 42999 22 0	1		ขี้เลื่อย puik original 1kg	75	
สัตว์ฟันแทะ	4 8970 14971 48 0	1		ขี้เลื่อย onepets กลิ่นลาเวนเดอร์ 500g	35	
สัตว์ฟันแทะ	4 8970 14971 53 4	1		ขี้เลื่อย onepets กลิ่นธรรมสชาติ 500g	35	
สัตว์ฟันแทะ	4 8970 14971 50 3	1		ขี้เลื่อย onepets กลิ่นกุหลาบ 500g	35	
สัตว์ฟันแทะ	4 8970 14971 51 0	1		ขี้เลื่อย onepets กลิ่นแอปเปิล 500g	35	
สัตว์ฟันแทะ	8 8876 77600 24 3	1		ขี้เลื่อย Delikate 1kg	75	
สัตว์ฟันแทะ	0 0000 41000 09 0			timothy hay (ชมพู) 425g	135	
สัตว์ฟันแทะ	0 0000 41000 07 6			alfafa hay (เขียว) 425g	135	
สัตว์ฟันแทะ	0 0718 59008 09 7			alfafa hay KAYTEE 680.4g	230	
นมและขวดนม	8 8502 38016 21 0			นมผง SK 150g	95	
นมและขวดนม	8 8502 38016 22 7			นมผง SK 300g	165	
นมและขวดนม	8 8502 38094 51 5			นมผง COCO KAT 150g	95	
นมและขวดนม	8 8507 81904 33 0			นมผง AG-SCI 20g	20	
นมและขวดนม	8 8507 81906 07 5	1		นมผง AG-SCI 250g	145	
นมและขวดนม	8 8507 81909 36 6			นมผง AG-SCI gold 15g	25	
นมและขวดนม	8 8507 81907 46 1	1		นมผง AG-SCI gold 200g	245	
นมและขวดนม	8 8507 81907 55 3			นม tiny-tiger 245 ml	60	
นมและขวดนม	8 8507 81907 20 1			นมแพะ AG-SCI gold 400 ml	65	
นมและขวดนม	8 8507 81907 23 2			นมแพะ AG-SCI gold plus 400 ml	100	
นมและขวดนม	8 8504 77020 31 3			นมแพะ SH	65	
นมและขวดนม	8 8535 27914 16 7			ขวดนม Big boss	65	
นมและขวดนม	1 1142 01926 00 1			ขวดนม HOP	95	
นมและขวดนม	8 8502 38950 65 1			ขวดนม SK nursing	95	
นมและขวดนม	8 8502 38016 16 6			ขวดนม SK feeding	95	
แชมพู	0 2546 00000 03 0			ชพ. Pro care ดับกลิ่น (น้ำตาล) 250ml	40	
แชมพู	0 7457 60629 22 0			สเปรย์ดับกลิ่นทรายแมว kanimal 300ml	159	
แชมพู	0 7457 60629 28 2			สเปรย์อาบแห้งสุนัข Pet protect 300ml	239	
แชมพู	0 7457 60629 29 9			สเปรย์อาบแห้งแมว Pet protect 300ml	249	
แชมพู	0 7457 60629 30 5			สเปร์ยอาบแห้ง กระต่าย pet protect 300ml	259	
แชมพู	0 7457 60629 39 8			สเปรย์ไล่แมว Kanimal 300ml	179	
แชมพู	0 7457 60629 41 1			Cage&Hutch spray pet protect 500 ml	279	
แชมพู	0 7457 60629 45 9			"น้ำยาดับกลิ่นปากแมว Pet protect Oxygen, Zinc&mint 237ml"	279	
แชมพู	0 7457 60629 46 6			น้ำยาดับกลิ่นปากแมว Pet protect Vit.C 237ml	299	
แชมพู	0 7457 60629 47 3			"น้ำยาดับกลิ่นปากสุนัข Pet protect Oxygen, Zinc&mint 237ml"	259	
แชมพู	0 7457 60629 48 0			น้ำยาดับกลิ่นปากสุนัข Pet protect Vit.C 237ml	279	
แชมพู	0 7457 60629 52 7			โฟมอาบแห้งสุนัข Pet protect 200ml	295	
แชมพู	0 7457 60629 53 4			โฟมอาบแห้งแมว Pet protect 200ml	295	
แชมพู	0 7457 60629 54 1			โฟมอาบแห้ง กระต่าย pet protect 150ml	295	
แชมพู	0 7457 60629 73 2			ชพ.สมุนไพรสุนัข Kaminal 280ml	149	
แชมพู	0 7457 60629 74 9			ชพ.สมุนไพรแมว Kaminal 280ml	149	
แชมพู	0 8058 49277 39 8			น้ำยาทำความสะอาดพื้น Pet protect 1000ml	290	
แชมพู	0 8058 49278 45 6			สเปรย์ดับกลิ่นกรง Pet protect 500ml	250	
แชมพู	0 8058 49334 48 0			สเปรย์ดับกลิ่นทรายแมว Pet protect 500ml	250	
แชมพู	0 8858 73870 23 9			สเปรย์นาโน NANO CARE 20ml	245	
แชมพู	2 3456 78945 68 9			ครีมขี้เลื้อน Ectotic	55	
แชมพู	2 5273 78301 00 6			Focus ชพ. 2 in 1 1000cc.	220	
แชมพู	2 5451 00009 09 9			สเปรย์กำจัดเห็บหมัด Pro care 250ml	85	
แชมพู	2 5452 00000 01 9			ชพ. Pro care SPA (ม่วง) 360ml	59	
แชมพู	2 5452 00000 03 3			ชพ. Pro care SPA (ส้ม) 360ml	59	
แชมพู	2 5452 00000 04 0			ชพ. Pro care SPA (เขียว) 360ml	59	
แชมพู	2 5452 00000 05 7			ชพ. Pro care SPA (ชมพู) 360ml	59	
แชมพู	2 5461 10000 00 1			แป้งProcare 150g	40	
แชมพู	2 5461 10000 04 5			ชพ. Pro care กำจัดเห็บหมัด (เขียว) 250ml	40	
แชมพู	2 5461 10000 05 2			ชพ. Pro care ลูกสุนัข (เหลือง) 240ml	40	
แชมพู	2 5461 10000 06 9			ชพ. Pro care กำจัดเห็บหมัด (เขียว) 1000ml	120	
แชมพู	2 5461 10000 07 6			ชพ. Pro care ลูกสุนัข (เหลือง) 1000ml	120	
แชมพู	2 5461 10000 09 0			ชพ. Pro care ดับกลิ่น (น้ำตาล) 1000ml	120	
แชมพู	4 5982 00297 69 7			Focus น้ำยาทำความสะอาด 1000cc.	135	
แชมพู	5 3211 42151 11 1			OZOL ฆ่าเชื้อแบคทีเรีย 1000ml	115	
แชมพู	8 8502 38010 70 6			น้ำยาเช็ดหู SK 50ml	65	
แชมพู	8 8502 38010 71 3			น้ำยาเช็ดหู SK 100ml	95	
แชมพู	8 8502 38010 82 9			แป้ง SK 150g	60	
แชมพู	8 8502 38010 88 1			สเปรย์ดับกลิ่นตัว SK 500ml	129	
แชมพู	8 8502 38010 91 1			สเปรย์กำจัดเห็บหมัด SK 250ml	85	
แชมพู	8 8502 38010 94 2			สเปรย์ดับกลิ่นกรง SK 500ml	129	
แชมพู	8 8502 38050 11 5			ชพ.535 220ml	75	
แชมพู	8 8502 38050 21 4			สเปรย์กำจัดเห็บหมัด 535 250ml	85	
แชมพู	8 8502 38050 32 0			แป้ง535 150g	60	
แชมพู	8 8502 38070 51 9			ชพ. HOBBY สุนัขขนยาว(ส้ม) 300ml	65	
แชมพู	8 8502 38070 52 6			ชพ. HOBBY สุนัขขนยาว(ส้ม) 500ml	95	
แชมพู	8 8502 38070 61 8			ชพ. HOBBY สุนัขขนสั้น(เขียว) 300ml	65	
แชมพู	8 8502 38070 71 7			ชพ. HOBBY ลูกสุนัข(เหลือง) 300ml	65	
แชมพู	8 8502 38070 72 4			ชพ. HOBBY ลูกสุนัข(เหลือง) 500ml	95	
แชมพู	8 8502 38070 81 6			ชพ. HOBBY กำจัดกลิ่น(ฟ้า) 300ml	65	
แชมพู	8 8502 38070 82 3			ชพ. HOBBY กำจัดกลิ่น(ฟ้า) 500ml	95	
แชมพู	8 8502 38070 91 5			ชพ. HOBBY กำจัดเห็บหมัด(แดง) 300ml	65	
แชมพู	8 8502 38070 92 2			ชพ. HOBBY กำจัดเห็บหมัด(แดง) 500ml	95	
แชมพู	8 8502 38071 51 6			ชพ.แมว HOBBY ขนยาว(ชมพู) 300ml	65	
แชมพู	8 8502 38071 52 3			ชพ.แมว HOBBY ขนยาว(ชมพู) 500ml	93	
แชมพู	8 8502 38071 61 5			ชพ.แมว HOBBY ขนสั้น(ม่วง) 300ml	65	
แชมพู	8 8502 38071 62 2			ชพ.แมว HOBBY ขนสั้น(ม่วง) 500ml	93	
แชมพู	8 8502 92410 11 5			แป้งBearing 150g	60	
แชมพู	8 8502 92420 11 4			ชพ.แห้ง Bearing 150g	60	
แชมพู	8 8502 92511 01 0			ชพ. Bearing ทุกสายพันธุ์ (ส้ม) 150ml	49	
แชมพู	8 8502 92511 02 7			ชพ. Bearing ทุกสายพันธุ์ (ส้ม) 300ml	79	
แชมพู	8 8502 92511 03 4			ชพ. Bearing ทุกสายพันธุ์ (ส้ม) 600ml	135	
แชมพู	8 8502 92511 04 1			ชพ. Bearing ทุกสายพันธุ์ (ส้ม) 1500ml	269	
แชมพู	8 8502 92511 05 8			ชพ. Bearing ทุกสายพันธุ์ (ส้ม) 3000ml	429	
แชมพู	8 8502 92513 01 4			ชพ. Bearing ขนยาว (เขียว) 150ml	49	
แชมพู	8 8502 92513 02 1			ชพ. Bearing ขนยาว (เขียว) 300ml	79	
แชมพู	8 8502 92513 03 8			ชพ. Bearing ขนยาว (เขียว) 600ml	135	
แชมพู	8 8502 92513 04 5			ชพ. Bearing ขนยาว (เขียว) 1500ml	269	
แชมพู	8 8502 92513 05 2			ชพ. Bearing ขนยาว (เขียว) 3000ml	429	
แชมพู	8 8502 92514 01 1			ชพ. Bearing ขนสีขาว (ใส) 150ml	49	
แชมพู	8 8502 92514 02 8			ชพ. Bearing ขนสีขาว (ใส) 300ml	79	
แชมพู	8 8502 92514 03 5			ชพ. Bearing ขนสีขาว (ใส) 600ml	135	
แชมพู	8 8502 92515 01 8			ชพ. Bearing ดับกลิ่น (แดง) 150ml	49	
แชมพู	8 8502 92515 02 5			ชพ. Bearing ดับกลิ่น (แดง) 300ml	79	
แชมพู	8 8502 92515 03 2			ชพ. Bearing ดับกลิ่น (แดง) 600ml	135	
แชมพู	8 8502 92515 04 9			ชพ. Bearing ดับกลิ่น (แดง) 1500ml	269	
แชมพู	8 8502 92515 05 6			ชพ. Bearing ดับกลิ่น (แดง) 3000ml	429	
แชมพู	8 8502 92516 01 5			ชพ. Bearing พันธุ์เล็ก (ชมพู) 150ml	49	
แชมพู	8 8502 92516 02 2			ชพ. Bearing พันธุ์เล็ก (ชมพู) 300ml	79	
แชมพู	8 8502 92516 03 9			ชพ. Bearing พันธุ์เล็ก (ชมพู) 600ml	135	
แชมพู	8 8502 92516 05 3			ชพ. Bearing พันธุ์เล็ก (ชมพู) 3000ml	429	
แชมพู	8 8502 92516 08 4			ชพ. Bearing พันธุ์เล็ก (ชมพู) 1500ml	269	
แชมพู	8 8502 92561 02 2			น้ำยาเช็ดหูสุนัข Bearing 100ml	85	
แชมพู	8 8502 92570 01 7			สเปรย์ดับกลิ่นตัว Bearing 600ml	145	
แชมพู	8 8502 92571 01 4			สเปรย์ห้ามฉี่ Bearing 250ml	150	
แชมพู	8 8502 92571 03 8			สเปรย์กำจัดเห็บหมัด Bearing 250ml	115	
แชมพู	8 8502 92590 03 9			ชพ. Bearing Grooming กลิ่นแป้งเด็ก 365ml	65	
แชมพู	8 8502 92590 06 0			ชพ. Bearing Grooming กลิ่นหมากฝรั่ง 365ml	65	
แชมพู	8 8502 92590 18 3			ชพ. Bearing Grooming กลิ่นแอปเปิล 365ml	65	
แชมพู	8 8502 92591 03 6			ครีมนวด Bearing Grooming กลิ่นแป้งเด็ก 365ml	72	
แชมพู	8 8502 92591 51 7			สเปรย์ดับกลิ่นทรายแมว Bearing กลิ่นแป้งเด็ก 250ml	185	
แชมพู	8 8502 92591 63 0			น้ำยาเช็ดหูแมว Bearing 100ml	129	
แชมพู	8 8502 99009 33 6			สเปรย์ดับกลิ่น nano active กลิ่นเบบี้ พาวเดอร์ 300ml	110	
แชมพู	8 8502 99009 34 3			สเปรย์ดับกลิ่น nano active กลิ่นเบอร์รี่ เบอร์รี่ 300ml	110	
แชมพู	8 8502 99009 36 7			สเปรย์ดับกลิ่น nano active กลิ่นซีตรัส เอ็กซ์เพรส 300ml	110	
แชมพู	8 8502 99009 37 4			สเปรย์ดับกลิ่น nano active กลิ่นไวท์ซากุระ 300ml	110	
แชมพู	8 8512 91000 15 4			ชพ. silky care สูตรขนสั้น(ฟ้า) 400ml	140	
แชมพู	8 8512 91000 18 5			ชพ. silky care สูตรอ่อนโยน(ใส) 400ml	140	
แชมพู	8 8512 91002 30 1			ชพ. HERBAL FRESH สูตรสมุนไพรเข้มข้น 200ml	95	
แชมพู	8 8512 91007 55 9			โฟมอาบแห้งสุนัข&แมว Silkycare 135ml	190	
แชมพู	8 8514 95000 08 0			ชพ. เชนการ์ด กำจัดเห็บหมัด(ส้ม) 350ml	95	
แชมพู	8 8514 95000 10 3			ชพ. เชนการ์ด กำจัดเห็บหมัด(ส้ม) 200ml	65	
แชมพู	8 8514 95000 12 7			ชพ. เชนการ์ด กำจัดเห็บหมัด(ส้ม) 100ml	38	
แชมพู	8 8514 95000 14 1			ชพ. เชนการ์ด พันธุ์เล็ก(ฟ้า) 350ml	95	
แชมพู	8 8514 95000 16 5			ชพ. เชนการ์ด พันธุ์เล็ก(ฟ้า) 200ml	65	
แชมพู	8 8514 95000 18 9			ชพ. เชนการ์ด พันธุ์เล็ก(ฟ้า) 100ml	38	
แชมพู	8 8514 95001 64 3			ชพ. เชนการ์ด ลดการคัน(เขียว) 1000ml	230	
แชมพู	8 8514 95001 89 6			ชพ. เชนการ์ด ลดกลิ่น(น้ำตาล) 350ml	95	
แชมพู	8 8514 95001 91 9			ชพ. เชนการ์ด กำจัดเห็บหมัด(ส้ม) 1000ml	230	
แชมพู	8 8514 95001 92 6			ชพ. เชนการ์ด พันธุ์เล็ก(ฟ้า) 1000ml	230	
แชมพู	8 8514 95001 93 3			ชพ. เชนการ์ด ลดกลิ่น(น้ำตาล) 200ml	65	
แชมพู	8 8514 95001 95 7			ชพ. เชนการ์ด ลดกลิ่น(น้ำตาล) 100ml	38	
แชมพู	8 8514 95001 96 4			ชพ. เชนการ์ด ลดการคัน(เขียว) 200ml	65	
แชมพู	8 8514 95001 97 1			ชพ. เชนการ์ด ลดการคัน(เขียว) 100ml	38	
แชมพู	8 8514 95002 71 8			แป้งเชนการ์ด 100g	45	
แชมพู	8 8514 95002 73 2			แป้งเชนการ์ด 200g	65	
แชมพู	8 8514 95002 91 6			ชพ. เชนการ์ด พันธุ์เล็ก(ฟ้า) 500ml ชนิดเติม	105	
แชมพู	8 8514 95004 29 3			ชพ. เชนการ์ด ลูกสุนัข(ชมพู) 350ml	95	
แชมพู	8 8514 95004 31 6			ชพ. เชนการ์ด ลูกสุนัข(ชมพู) 200ml	65	
แชมพู	8 8514 95004 44 6			ชพ. เชนการ์ด ลูกสุนัข(ชมพู) 100ml	38	
แชมพู	8 8514 95004 74 3			ชพ. เชนการ์ด ลูกสุนัข(ชมพู) 1000ml	230	
แชมพู	8 8538 00501 16 9			ชพ. paully แฟนตาซี 250ml	120	
แชมพู	8 8556 48000 25 5			ครีมนวด Ostech กลิ่นแอปเปิล 750ml 	150	
แชมพู	8 8556 48000 26 2			ครีมนวด Ostech กลิ่นสตอเบอรี่ 750ml 	150	
แชมพู	8 8556 48000 27 9			ครีมนวด Ostech กลิ่นแคนตาลูป 750ml 	150	
แชมพู	8 8556 48000 28 6			ครีมนวด Ostech กลิ่นบลูเบอรี่ 750ml 	150	
แชมพู	8 8556 48000 50 7			ครีมนวด Ostech กลิ่นลิ้นจี่ 750ml 	150	
แชมพู	8 8556 48000 51 4			ครีมนวด Ostech กลิ่นผลไม้รวม 750ml 	150	
แชมพู	8 8556 48000 61 3			ชพ. Ostech กำจัดกลิ่น(น้ำตาล) 400ml	120	
แชมพู	8 8556 48000 66 8			ชพ. Ostech Hypo 500ml	220	
แชมพู	8 8556 48002 20 4			ชพ. Ostech Milkycon กลิ่นส้ม เมลอน สับปะรด 750ml 	120	
แชมพู	8 8556 48002 21 1			ชพ. Ostech Milkycon กลิ่นสับปะรด 750ml 	120	
แชมพู	8 8556 48002 23 5			ชพ. Ostech Milkycon กลิ่นสตอเบอรี่ แอปพริคอต ส้ม 750ml 	120	
แชมพู	8 8556 48002 24 2			ชพ. Ostech Milkycon กลิ่นส้ม แพร 750ml 	120	
แชมพู	8 8556 48002 25 9			ชพ. Ostech Milkycon กลิ่นบลูเบอรี่ องุ่น แบล็คเคอร์เร้นท์ 750ml 	120	
แชมพู	8 8566 13000 00 3			ยาม่วง 30ml	50	
แชมพู	8 8566 13000 02 7			ชพ. เพซซิโอ 250ml	140	
แชมพู	8 8566 13000 05 8			สเปรย์ เพซซิโอ 200ml	190	
แชมพู	8 8566 13220 00 5			ยาม่วง สเปรย์ VK 50ml	120	
แชมพู	8 8566 69000 17 0			น้ำยาเช็ดหู Topscent 120ml	95	
แชมพู	8 8566 69000 30 9			น้ำยากำจัดกลิ่นน้ำตาสุนัข Topscent 120ml	95	
แชมพู	8 8571 01750 78 3			สเปรย์อาบแห้ง Petme กลิ่นอโวคาโด 250ml	180	
แชมพู	8 8571 23178 85 5			น้ำยาเช็ดคราบน้ำตา charming 120ml	120	
แชมพู	8 8581 70001 00 4			สเปรย์ห้ามขับถ่าย(ภายนอก) 100ml	130	
แชมพู	8 8581 80001 00 1			สเปรย์ห้ามขับถ่าย(ภายใน) 100ml	130	
แชมพู	8 8592 28620 01 7			น้ำหอม Paully กลิ่น HYPNOS (ชมพู)110ml	140	
แชมพู	8 8592 28620 06 2			ชพ. paully กุหลาบ 250ml	120	
แชมพู	8 8592 28620 07 9			น้ำหอม Paully กลิ่น AMOR (เขียว)110ml	140	
แชมพู	8 8592 28620 08 6			น้ำหอม Paully กลิ่น BREEZ (ม่วง)110ml	140	

'''
    count = 0
    for i, dat in enumerate(data.split('\n')):
        dat = dat.split('\t')
        try:
            category = dat[0]
            barcode = dat[1]
            quantity = dat[2]
            comment = dat[3]
            product_name = dat[4]
            price = dat[5]
            barcode = barcode.replace(' ', '')
            try:
                quantity = int(quantity)
            except:
                quantity = 0
            try:
                price = float(price)
            except:
                price = 0
            # check cat
            cats = Category.objects.filter(name=category)
            if len(cats) == 0:
                cat = Category.objects.create(
                    name=category
                )
            elif len(cats) == 1:
                cat = cats.first()

            product = Product.objects.create(
                category_obj=cat,
                barcode=barcode,
                name=product_name,
                price=price,
                inventory=quantity,
                description = comment,
            )
            print('added', i)
            count += 1

        except Exception as e:
            print('error', e)
            pass
    return count
    # print([data])


if __name__ == '__main__':
    count = m1()
    print('succes ', count)
